tool/dos-batch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-03 Sun 14:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DOS Batch 编程</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">DOS Batch 编程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf33a5e4">1. 编程范式</a></li>
<li><a href="#org3ffd78e">2. 定义函数</a></li>
<li><a href="#org5d2bc58">3. 获取返回值</a></li>
<li><a href="#orge89323d">4. 定义多行字符串</a></li>
<li><a href="#org6463592">5. 遍历传入的命令行参数</a></li>
<li><a href="#org2b92bcb">6. 常见功能</a></li>
<li><a href="#orgd62df64">7. 连接远程共享文件系统</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf33a5e4" class="outline-2">
<h2 id="orgf33a5e4"><span class="section-number-2">1</span> 编程范式</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-bat">@<span style="color: #6c71c4;">echo</span> off
<span style="color: #6c71c4;">setlocal</span> EnableExtensions
<span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">HERE</span>=%~dp0
<span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">DRIVER</span>=%~d0


<span style="color: #93a1a1; font-style: italic;">rem </span><span style="color: #93a1a1; font-style: italic;">coding...</span>


<span style="font-weight: bold;">:DONE</span>
<span style="color: #6c71c4;">endlocal</span>
<span style="color: #6c71c4;">echo</span> on
<span style="color: #859900;">exit</span> /<span style="color: #268bd2;">b</span> 0
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ffd78e" class="outline-2">
<h2 id="org3ffd78e"><span class="section-number-2">2</span> 定义函数</h2>
<div class="outline-text-2" id="text-2">
<p>
Batch 脚本中没有函数，可以使用符号模拟的方式来创建
</p>
<ol class="org-ol">
<li>定义的函数一定要写在脚本最后</li>
<li>需要通过 <code>call</code> 来模拟函数调用</li>
</ol>
<div class="org-src-container">
<pre class="src src-bat"><span style="color: #859900;">call</span> <span style="color: #268bd2;">:GetDateTime</span> time0
<span style="color: #859900;">call</span> <span style="color: #268bd2;">:Sleep</span> 10
<span style="color: #859900;">call</span> <span style="color: #268bd2;">:GetDateTime</span> time1

<span style="color: #6c71c4;">echo</span> %<span style="color: #6c71c4;">time0</span>%
<span style="color: #6c71c4;">echo</span> %<span style="color: #6c71c4;">time1</span>%


<span style="font-weight: bold;">:DONE</span>
<span style="color: #6c71c4;">endlocal</span>
<span style="color: #6c71c4;">echo</span> on
<span style="color: #859900;">exit</span> /<span style="color: #268bd2;">b</span> 0

<span style="font-weight: bold;">:GetDateTime</span>
<span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">DATETAG</span>=%<span style="color: #6c71c4;">date:</span>~0,4%<span style="color: #6c71c4;">-</span>%<span style="color: #6c71c4;">date</span>:~5,2%<span style="color: #6c71c4;">-</span>%<span style="color: #6c71c4;">date</span>:~8,2%
<span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">TIMETAG</span>=%<span style="color: #6c71c4;">time:</span>~0,2%<span style="color: #6c71c4;">:</span>%<span style="color: #6c71c4;">time</span>:~3,2%<span style="color: #6c71c4;">:</span>%<span style="color: #6c71c4;">time</span>:~6,2%
<span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">HOUR</span>=%<span style="color: #6c71c4;">time:</span>~0,2%
<span style="color: #859900;">if</span> /<span style="color: #268bd2;">i</span> %<span style="color: #6c71c4;">HOUR</span>% <span style="color: #859900;">lss</span> 10 (<span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">TIMETAG</span>=0%<span style="color: #6c71c4;">time:</span>~1,1%<span style="color: #6c71c4;">:</span>%<span style="color: #6c71c4;">time</span>:~3,2%<span style="color: #6c71c4;">:</span>%<span style="color: #6c71c4;">time</span>:~6,2%<span style="color: #6c71c4;">)</span>
<span style="color: #6c71c4;">set</span> %~1=%<span style="color: #6c71c4;">DATETAG</span>% %<span style="color: #6c71c4;">TIMETAG</span>%
<span style="color: #859900;">exit</span> /<span style="color: #268bd2;">b</span> 0

<span style="font-weight: bold;">:Sleep</span>
ping -<span style="color: #268bd2;">n</span> %~1 127.0.0.1 &gt;nul 2&gt;&amp;1
<span style="color: #859900;">exit</span> /<span style="color: #268bd2;">b</span> 0
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d2bc58" class="outline-2">
<h2 id="org5d2bc58"><span class="section-number-2">3</span> 获取返回值</h2>
<div class="outline-text-2" id="text-3">
<p>
Batch 脚本通过 <code>%ERRORLEVEL%</code> 变量获取，常见的代码片段如下
</p>
<div class="org-src-container">
<pre class="src src-bat">execute.exe
<span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">RETCODE</span>=0
<span style="color: #859900;">if</span> /<span style="color: #268bd2;">i</span> %<span style="color: #6c71c4;">ERRORLEVEL</span>% <span style="color: #859900;">neq</span> 0 (<span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">RETCODE</span>=%<span style="color: #6c71c4;">ERRORLEVEL</span>%)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge89323d" class="outline-2">
<h2 id="orge89323d"><span class="section-number-2">4</span> 定义多行字符串</h2>
<div class="outline-text-2" id="text-4">
<p>
可以使用 <code>^</code> 符号来对长字符串进行折行
</p>
<div class="org-src-container">
<pre class="src src-bat"><span style="color: #6c71c4;">echo</span> long text without^
new line terminated, folding^
with ^^ symbol
</pre>
</div>

<p>
上述命令执行结果如下
</p>
<div class="org-src-container">
<pre class="src src-text">D:\Code&gt; echo long text without^
More? new line terminated, folding^
More? with ^^ symbol
long text withoutnew line terminated, foldingwith ^ symbol
</pre>
</div>
</div>
</div>

<div id="outline-container-org6463592" class="outline-2">
<h2 id="org6463592"><span class="section-number-2">5</span> 遍历传入的命令行参数</h2>
<div class="outline-text-2" id="text-5">
<p>
这里使用到
</p>
<ol class="org-ol">
<li><code>shift</code> 来移动传入的参数</li>
<li>通过跳转来模拟循环</li>
</ol>
<div class="org-src-container">
<pre class="src src-bat">@<span style="color: #6c71c4;">echo</span> off
<span style="font-weight: bold;">:Loop</span>
<span style="color: #859900;">if</span> <span style="color: #2aa198;">"%1"</span>==<span style="color: #2aa198;">""</span> <span style="color: #859900;">goto</span> <span style="color: #268bd2;">EndLoop</span>
<span style="color: #859900;">for</span> %%<span style="color: #6c71c4;">a</span> <span style="color: #859900;">in</span> (%<span style="color: #6c71c4;">1)</span> <span style="color: #859900;">do</span> <span style="color: #6c71c4;">echo</span> %%<span style="color: #6c71c4;">a</span>
<span style="color: #6c71c4;">shift</span>
<span style="color: #859900;">goto</span> <span style="color: #268bd2;">Loop</span>

<span style="font-weight: bold;">:EndLoop</span>
</pre>
</div>

<p>
需要注意的是当传入的参数包含 <code>"</code> 时，判断空字符串可以考虑以下形式
</p>
<div class="org-src-container">
<pre class="src src-bat"><span style="color: #859900;">if</span> [%<span style="color: #6c71c4;">1]==[]</span> <span style="color: #859900;">goto</span> <span style="color: #268bd2;">EndLoop</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b92bcb" class="outline-2">
<h2 id="org2b92bcb"><span class="section-number-2">6</span> 常见功能</h2>
<div class="outline-text-2" id="text-6">
<p>
获取当前机器 IP
</p>
<div class="org-src-container">
<pre class="src src-bat"><span style="color: #859900;">for</span> /<span style="color: #268bd2;">f</span> <span style="color: #2aa198;">"delims=[] tokens=2"</span> %%<span style="color: #6c71c4;">a</span> <span style="color: #859900;">in</span> ('ping %<span style="color: #6c71c4;">computername</span>% -<span style="color: #268bd2;">4</span> -<span style="color: #268bd2;">n</span> 1 ^| <span style="color: #6c71c4;">findstr</span> <span style="color: #2aa198;">"["</span>') <span style="color: #859900;">do</span> (<span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">IPSTR</span>=%%<span style="color: #6c71c4;">a)</span>
</pre>
</div>

<p>
获取当前主机名称
</p>
<div class="org-src-container">
<pre class="src src-bat"><span style="color: #859900;">for</span> /<span style="color: #268bd2;">f</span> %%<span style="color: #6c71c4;">a</span> <span style="color: #859900;">in</span> ('hostname') <span style="color: #859900;">do</span> <span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">HOSTSTR</span>=%%<span style="color: #6c71c4;">a</span>
</pre>
</div>

<p>
统计 txt 文件名数量
</p>
<div class="org-src-container">
<pre class="src src-bat"><span style="color: #6c71c4;">setlocal</span> EnableExtensions
<span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">TEXT_COUNT</span>=0
<span style="color: #859900;">for</span> %%<span style="color: #6c71c4;">a</span> <span style="color: #859900;">in</span> (*.txt) <span style="color: #859900;">do</span> <span style="color: #6c71c4;">set</span> <span style="color: #6c71c4;">/</span><span style="color: #6c71c4;">a</span> TEXT_COUNT+=1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd62df64" class="outline-2">
<h2 id="orgd62df64"><span class="section-number-2">7</span> 连接远程共享文件系统</h2>
<div class="outline-text-2" id="text-7">
<p>
Windows 可以使用 <code>net use</code> 命令来连接远程共享的网络文件系统
</p>
<div class="org-src-container">
<pre class="src src-text">D:\Test&gt;net use /?
&#27492;&#21629;&#20196;&#30340;&#35821;&#27861;&#26159;:

NET USE
[devicename | *] [\\computername\sharename[\volume] [password | *]]
        [/USER:[domainname\]username]
        [/USER:[dotted domain name\]username]
        [/USER:[username@dotted domain name]
        [/SMARTCARD]
        [/SAVECRED]
        [/REQUIREINTEGRITY]
        [/REQUIREPRIVACY]
        [/WRITETHROUGH]
        [[/DELETE] | [/PERSISTENT:{YES | NO}]]

NET USE {devicename | *} [password | *] /HOME

NET USE [/PERSISTENT:{YES | NO}]

D:\Test&gt;net use
&#20250;&#35760;&#24405;&#26032;&#30340;&#32593;&#32476;&#36830;&#25509;&#12290;


&#29366;&#24577;       &#26412;&#22320;        &#36828;&#31243;                      &#32593;&#32476;

-------------------------------------------------------------------------------
OK           Z:        \\192.168.1.100\Share      Microsoft Windows Network
&#21629;&#20196;&#25104;&#21151;&#23436;&#25104;&#12290;


D:\Test&gt;net use z: /delete
&#22312;&#19982; z: &#30340;&#36830;&#25509;&#20013;&#65292;&#26377;&#25171;&#24320;&#30340;&#25991;&#20214;&#21644;/&#25110;&#27809;&#26377;&#32467;&#26463;&#30340;&#30446;&#24405;&#25628;&#32034;&#12290;

&#26159;&#21542;&#32487;&#32493;&#26029;&#24320;&#36830;&#25509;&#24182;&#24378;&#34892;&#20851;&#38381;? (Y/N) [N]: y
z: &#24050;&#32463;&#21024;&#38500;&#12290;


D:\Test&gt;net use z: \\192.168.1.100\Share
&#21629;&#20196;&#25104;&#21151;&#23436;&#25104;&#12290;


D:\Test&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-01-03 Sun 14:59. Created by Jinghui Hu at 2020-12-30 Wed 19:16.</p>
</div>
</body>
</html>
